-- Таблица gyms (спортзалы)
INSERT INTO gyms (gym_id, name, address, description) VALUES
(1, 'Фитнес-Центр Олимп', 'ул. Спортивная, 1', 'Современный фитнес-центр с разнообразными услугами'),
(2, 'Тренажерный зал Атлант', 'ул. Силачей, 10', 'Тренажерный зал с широким выбором оборудования'),
(3, 'Студия Йоги Лотос', 'ул. Здоровья, 5', 'Уютная студия для занятий йогой и медитацией'),
(4, 'Сити Фитнес', 'ул. Энергии, 20', 'Фитнес-центр в центре города'),
(5, 'Зал Выносливости', 'ул. Спарта, 12', 'Тренировки для повышения выносливости и силы'),
(6, 'Премиум Тренажерка', 'ул. Элитная, 33', 'Элитный зал с тренажёрами последнего поколения');

-- Таблица gym_passes (абонементы)
INSERT INTO gym_passes (gp_id, name, price, description) VALUES
(1, 'Месячный абонемент', 2000, 'Доступ на все тренировки в течение месяца'),
(2, 'Разовое посещение', 300, 'Доступ на одну тренировку'),
(3, 'Годовой абонемент', 20000, 'Доступ на все тренировки в течение года'),
(4, 'Абонемент выходного дня', 1000, 'Доступ на тренировки в субботу и воскресенье');

-- Таблица fitness_equipment (тренажёры)
INSERT INTO fitness_equipment (equipment_id, name, description) VALUES
(1, 'Беговая дорожка', 'Электронная беговая дорожка с несколькими режимами'),
(2, 'Гантели', 'Набор гантелей разного веса'),
(3, 'Велотренажер', 'Стационарный велотренажер для кардио-тренировок'),
(4, 'Скамья для жима', 'Удобная скамья для выполнения жимов'),
(5, 'Эллиптический тренажер', 'Тренажер для кардио с низкой нагрузкой на суставы'),
(6, 'Штанга', 'Олимпийская штанга с набором блинов'),
(7, 'Гребной тренажер', 'Симулятор гребли для кардио'),
(8, 'Силовая рама', 'Многофункциональная силовая рама'),
(9, 'Кроссовер', 'Машина для выполнения упражнений с тросами'),
(10, 'Жим ногами', 'Тренажер для жима ногами'),
(11, 'Турник', 'Настенный турник для подтягиваний'),
(12, 'Петли TRX', 'Оборудование для функциональных тренировок'),
(13, 'Медицинские мячи', 'Набор мячей разного веса для функциональных тренировок'),
(14, 'Степ-платформы', 'Платформы для аэробных тренировок'),
(15, 'Боксерская груша', 'Подвесной мешок для бокса'),
(16, 'Тренажер для пресса', 'Удобный тренажер для укрепления мышц пресса'),
(17, 'Ролик для пресса', 'Простой тренажер для укрепления пресса'),
(18, 'Жимовая машина', 'Тренажер для жима в сидячем положении'),
(19, 'Скакалки', 'Оборудование для кардио-тренировок'),
(20, 'Гиперэкстензия', 'Тренажер для тренировки нижней части спины');

-- Таблица availability (наличие оборудования в залах)
INSERT INTO availability (id, gym_id, equipment_id, amount) VALUES
(1, 1, 1, 5),  -- В зале Олимп 5 беговых дорожек
(2, 1, 2, 10), -- В зале Олимп 10 гантелей
(3, 1, 6, 3),  -- В зале Олимп 3 штанги
(4, 2, 3, 2),  -- В зале Атлант 2 велотренажера
(5, 2, 4, 5),  -- В зале Атлант 5 скамей для жима
(6, 2, 7, 1),  -- В зале Атлант 1 гребной тренажер
(7, 3, 5, 4),  -- В студии Лотос 4 эллиптических тренажера
(8, 3, 14, 8), -- В студии Лотос 8 степ-платформ
(9, 4, 8, 2),  -- В Сити Фитнес 2 силовые рамы
(10, 4, 9, 1), -- В Сити Фитнес 1 кроссовер
(11, 5, 10, 3),-- В Зале Выносливости 3 тренажера для жима ногами
(12, 5, 11, 5),-- В Зале Выносливости 5 турников
(13, 5, 13, 6),-- В Зале Выносливости 6 медицинских мячей
(14, 6, 15, 1),-- В Премиум Тренажерке 1 боксерская груша
(15, 6, 16, 4),-- В Премиум Тренажерке 4 тренажера для пресса
(16, 6, 17, 10),-- В Премиум Тренажерке 10 роликов для пресса
(17, 6, 18, 2),-- В Премиум Тренажерке 2 жимовых машины
(18, 6, 19, 12),-- В Премиум Тренажерке 12 скакалок
(19, 6, 20, 1);-- В Премиум Тренажерке 1 тренажер для гиперэкстензии
